package com.js.ooppackage;

public class Package {
	public static void main(String[] args) {
		
		/* 패키지 작명 방법
		 
		  1. 회사 이름이나 도메인(웹주소) 는 유일함
		  		// 도메인							.회사명				.프로그램명
		  		// com, kr, net, gov...			팀명, 그룹명			프로젝트명, 프로그램명
		  		// 회사가 바뀌지 않는 이상 같은 회사명 사용
		  		
		  		// 도메인	. 회사명 . 플랫폼 . 프로그램명
		  		// 플랫폼이란 : 안드로이드 or ios 등등
		  		  
		 * 패키지란 
		 	- 경로 및 폴더
		 	
		 		// 그래서 결국 폴더가 최대한 겹치지 않게 하기 위해서
		 		// 도메인이 겹치도록 만든다.
		 		  
		  2. 패키지명은 무조건 소문자로 작성한다 (약속)
		 	
		 */
		
		/* 접근 제한자 : 필드의 접근 범위를 설정
		 
 		  1. public : 어디서든 접근 가능
		 
		  2. protected : 같은 클래스, 같은 패키지, 상속관계에서 접근 가능 
		 
		  3. default(안쓴거) : 같은 패키지에서만 접근 가능 
		 
		  4. private : 같은 클래스 내에서만 접근 가능
		
		
		
		 */
	}
}
